class Helper(object):
    HELP_ABOUT = '''
**➻ ᴛʜɪs ɪs <u>{0}</u>
─────────────────────────
❖ ᴧ ϻᴜsɪᴄ ʙσᴛ ғσʀ ᴛєʟєɢʀᴧϻ ɢʀσᴜᴘs / ᴄʜᴧηηєʟs
─────────────────────────
● ᴡʀɪᴛᴛєη ɪη ➥ [ᴩʏᴛʜση](https://www.python.org/)
● ᴅᴧᴛᴧʙᴧsє ➥ [ϻᴏηɢᴏ-ᴅʙ](https://www.mongodb.com/)
● ʜєʟᴘ ᴡɪᴛʜ [ᴘʏʀᴏɢʀᴧϻ](https://github.com/pyrogram/pyrogram) & [ᴘʏ-ᴛɢᴄᴧʟʟs](https://github.com/pytgcalls/pytgcalls).
─────────────────────────
✦ ηᴏ ʟᴀɢ • ηᴏ ᴧᴅs • ηᴏ ʙᴜɢs • 24/7 sᴜᴘᴘᴏʀᴛ
✦ ᴇηᴊᴏʏ ʟᴧɢ ғʀєє ϻᴜsɪᴄ • ᴧᴅᴅ ϻє ηᴏᴡ
─────────────────────────
» ᴘʀɪᴠᴧᴛє & sєᴄυʀє sσᴜʀᴄє | ηᴏ ᴅᴧᴛᴧ sʜᴧʀᴇ
» ʟɪᴄєηᴄєᴅ ᴜsє | ʏσυтυʙє ᴀᴘɪ sυᴘᴘσʀтєᴅ 
──────────────────────
➤ ʙσᴛ sᴛᴧᴛυs & ϻσʀє ʙσᴛs - [ᴄʟɪᴄᴋ ʜєʀє](https://t.me/Jani_About)
➤ ᴘᴧɪᴅ ᴘʀσϻσᴛɪση :- [ᴄσηᴛᴧᴄᴛ ʜєʀє](https://t.me/Power_of_Jani)
─────────────────────────**
'''
    
    HELP_SUPPORT = '''
**❖ <u>{0}</u> sᴜᴘᴘᴏʀᴛ ɪηғσ :-

● 24/7 ᴧᴠᴧɪʟᴧʙʟє ғσʀ ᴧηʏ ʙσᴛ.
● ᴋᴇᴇᴘ ᴄʜᴧᴛ ᴄʟєᴧη ᴧηᴅ ʙᴜɢ-ғʀєє.
● ᴧηʏ ᴘʀσʙʟєϻ ? ᴊᴜsᴛ ᴄσηᴛᴧᴄᴛ ᴜs.
─────────────────────────
❖ υᴘᴅᴧᴛєs ᴄʜᴧηηєʟ ➥ [˹ᴊᴀɴɪ ʙᴏᴛꜱ˼](https://t.me/+cNTC85hb_Uk1NTJl)
❖ sυᴘᴘσʀᴛ ᴄʜᴧᴛ ➥ [˹ᴊᴀɴɪ ʙᴏᴛꜱ˼](https://t.me/Selfish_Jani_Lover)
❖ ɢɪᴛ ʜᴜʙ ʟɪηᴋ ➥ [тєᴧϻ-ᴊᴀɴɪ](https://t.me/Jani_About)
─────────────────────────**
'''


    HELP_GCSETUP = '''
<b><u>⊚ ɢʀᴏᴜᴘ sᴇᴛᴜᴘ ᴄᴏᴍᴍᴀɴᴅs :</b></u>

/pin : ᴘɪɴs ᴀ ᴍᴇssᴀɢᴇ
/unpin : ᴜɴᴘɪɴ ᴘɪɴɴᴇᴅ ᴍᴇssᴀɢᴇ
/pinned: sᴇᴇ ᴀʟʟ ᴘɪɴɴᴇᴅ ᴍᴇssᴀɢᴇs
/settitle : sᴇᴛ ɴᴀᴍᴇ ᴏғ ɢʀᴏᴜᴘ
/setdis : sᴇᴛ ʙɪᴏ ᴏғ ɢʀᴏᴜᴘ
/setphoto : sᴇᴛ ɢʀᴏᴜᴘ ᴘʜᴏᴛᴏ
/rmphoto : ʀᴇᴍᴏᴠᴇ ɢʀᴏᴜᴘ ᴘʜᴏᴛᴏ

**⊚ ᴘᴏᴡᴇʀᴇᴅ ʙʏ :- [˹ᴊᴀɴɪ ʙᴏᴛꜱ˼](https://t.me/Power_of_Jani)**
'''

    HELP_MOD = '''
<b><u>⊚ ɢʀᴏᴜᴘ ᴍᴏᴅᴇʀᴀᴛɪᴏɴ ᴄᴏᴍᴍᴀɴᴅs :</b></u>

/kickall - ᴋɪᴄᴋ ᴀʟʟ ᴍᴇᴍʙᴇʀs [ɴᴏᴛ ʙᴀɴ]
/muteall - ᴍᴜᴛᴇ ᴀʟʟ ᴍᴇᴍʙᴇʀs
/unmuteall : ᴜɴᴍᴜᴛᴇ ᴀʟʟ ᴍᴜᴛᴇᴅ ᴍᴇᴍʙᴇʀs
/unbanall : ᴜɴʙᴀɴ ᴀʟʟ ʙᴀɴɴᴇᴅ ᴍᴇᴍʙᴇʀs
/unpinall : ᴜɴᴘɪɴ ᴀʟʟ ᴘɪɴɴᴇᴅ ᴍᴇssᴀɢᴇs

**⊚ ᴘᴏᴡᴇʀᴇᴅ ʙʏ :- [˹ᴊᴀɴɪ ʙᴏᴛꜱ˼](https://t.me/Power_of_Jani)**
'''
    
    HELP_WEL = '''
<b><u>⊚ ᴡᴇʟᴄᴏᴍᴇ ᴄᴏᴍᴍᴀɴᴅs :</b></u>

/welcome on : ᴇɴᴀʙʟᴇ ᴡᴇʟᴄᴏᴍᴇ
/welcome off : ᴅɪsᴀʙʟᴇ ᴡᴇʟᴄᴏᴍᴇ

**⊚ ᴘᴏᴡᴇʀᴇᴅ ʙʏ :- [˹ᴊᴀɴɪ ʙᴏᴛꜱ˼](https://t.me/Power_of_Jani)**
'''

    HELP_VC = '''
<b><u>⊚ ᴠᴄ ʟᴏɢɢᴇʀ ᴄᴏᴍᴍᴀɴᴅs :</b></u>

/vclogger on : ᴠᴄ ʟᴏɢɢᴇʀ ᴏɴ
/vclogger off : ᴠᴄ ʟᴏɢɢᴇʀ ᴏғғ

**⊚ ᴘᴏᴡᴇʀᴇᴅ ʙʏ :- [˹ᴊᴀɴɪ ʙᴏᴛꜱ˼](https://t.me/Power_of_Jani)**
'''

    HELP_ADMIN = '''
<b><u>⊚ ᴘʀᴏᴍᴏᴛᴇ ᴄᴏᴍᴍᴀɴᴅs :</b></u>

/promote : ᴘʀᴏᴍᴏᴛᴇ ᴜsᴇʀ ᴀɴ ᴀᴅᴍɪɴ
/demote : ᴅᴇᴍᴏᴛᴇ ᴜsᴇʀ ᴀɴ ᴀᴅᴍɪɴ
/fullpromote : ᴘʀᴏᴍᴏᴛᴇ ᴜsᴇʀs ᴀᴅᴍɪɴ ᴡɪᴛʜ ғᴜʟʟ ʀɪɢʜᴛs

**⊚ ᴘᴏᴡᴇʀᴇᴅ ʙʏ :- [˹ᴊᴀɴɪ ʙᴏᴛꜱ˼](https://t.me/Power_of_Jani)**
'''


    HELP_BAN = '''
<b><u>⊚ ɢʀᴏᴜᴘ sᴇᴛᴜᴘ ᴄᴏᴍᴍᴀɴᴅs :</b></u>

/ban : ʙᴀɴ ᴀ ᴜsᴇʀ
/unban : ᴜɴʙᴀɴ ᴀ ᴜsᴇʀ
/mute : ᴍᴜᴛᴇ ᴀ ᴜsᴇʀ
/unmute : ᴜɴᴍᴜᴛᴇ ᴀ ᴜsᴇʀ
/tmute : ᴛɪᴍɪɴɢ ᴍᴜᴛᴇ 

**⊚ ᴘᴏᴡᴇʀᴇᴅ ʙʏ :- [˹ᴊᴀɴɪ ʙᴏᴛꜱ˼](https://t.me/Power_of_Jani)**
    '''
